#19.	Реализовать алгоритм задания случайных чисел. Без использования встроенного генератора псевдослучайных чисел

import os
from time import time

print(time() % 1, '\n')